recreational_activities_backend/app/controllers/api/v1/recreational_areas_controller.rb

    def create
        rec_area = @user.recreational_areas.new(rec_area_params)

        if (Api::V1::RecreationalArea.where(facility_name: rec_area.facility_name, user_id: @user).exists?)
            render json: rec_area.errors, status: :conflict
        else
            if (rec_area.save)
---
INSERT INTO "api_v1_recreational_areas" ("facility_name", "facility_description", "created_at", "updated_at", "facility_id", "facility_directions", "facility_email", "facility_phone", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)