recreational_activities_backend/app/controllers/api/v1/users_controller.rb

INSERT INTO "api_v1_users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "Dice"], ["created_at", "2020-12-06 20:15:29.493544"], ["updated_at", "2020-12-06 20:15:29.493544"]]
---
    def create
        user = Api::V1::User.create(user_params)